#분해합

# 어떤 자연수 N이 있을 때, 그 자연수 N의 분해합은 N과 N을 이루는 각 자리수의 합을 의미한다. 
# 어떤 자연수 M의 분해합이 N인 경우, M을 N의 생성자라 한다. 예를 들어, 245의 분해합은
#  256(=245+2+4+5)이 된다. 따라서 245는 256의 생성자가 된다. 
# 물론, 어떤 자연수의 경우에는 생성자가 없을 수도 있다. 
# 반대로, 생성자가 여러 개인 자연수도 있을 수 있다.
# 자연수 N이 주어졌을 때, N의 가장 작은 생성자를 구해내는 프로그램을 작성하시오.

# 입력
# 첫째 줄에 자연수 N(1 ≤ N ≤ 1,000,000)이 주어진다.

# 출력
# 첫째 줄에 답을 출력한다. 생성자가 없는 경우에는 0을 출력한다.

#자릿수 합 구하는 함수
def sum_digit(n):
    sum = 0
    while n > 0:
        sum += n % 10
        
        n = n // 10
    return sum

#입력 받음
n = input()

#자릿수 * 9로 최소범위 구하기
leng = len(n)
#int 형변환
n_num = int(n)

n_min = n_num - leng * 9

for i in range(n_min,n_num + 1):
    
    if n_num == sum_digit(i) + i:
        print(i)
        break
